# Напишіть функцію, яка приймає два аргументи.
# Якщо обидва аргумени відносяться до числових типів функція пермножує ці аргументи і повертає результат
# Якшо обидва аргументи відносяться до типу стрінг функція обʼєднує їх в один і повертає
# В будь-якому іншому випадку - функція повертає кортеж з двох агрументів
# Імпортуйте цю функцію, і викличте в іншому файлі


def function (a, b):
   if isinstance(a, (int, float)) and isinstance(b, (int, float)):
       return a * b
   elif isinstance(a, str) and isinstance(b, str):
       return a + b
   else:
       return a, b

